app/controllers/landlords_controller.rb

  def index
    @landlords = Landlord.paginate(page: params[:landlord]).order(:name).search(params[:search])
---
SELECT "landlords".* FROM "landlords" WHERE (name LIKE '%Faggot%') ORDER BY landlords.name ASC, name

  def show
    @landlord = Landlord.find(params[:id])
---
SELECT "landlords".* FROM "landlords" WHERE "landlords"."id" = ? ORDER BY landlords.name ASC LIMIT 1  [["id", "1"]]

  def create
    #check if a landlord of the same name already exists and add comments to that
    @landlord = Landlord.where(:name => params[:landlord][:name], \
     :city => params[:landlord][:city], \
     :province => params[:landlord][:province]).
    first_or_create
    if @landlord.valid?
      #refactor this shit
        # if validComment? params[:landlord][:comments_attributes]["0"][:comment]  &&
        #   params[:landlord][:comments_attributes]["0"][:terms]
          @landlord.comments.build
          @landlord.comments.last.setIP request.remote_ip
          @landlord.comments.last.comment = params[:landlord][:comments_attributes]["0"][:comment]
          @landlord.comments.last.terms = params[:landlord][:comments_attributes]["0"][:terms]
        # end
    end
    if @landlord.save
---
SELECT "landlords".* FROM "landlords" WHERE "landlords"."name" = 'test 1' AND "landlords"."city" = 'vtest 1' AND "landlords"."province" = 'test 1' ORDER BY landlords.name ASC LIMIT 1
SELECT "comments".* FROM "comments" WHERE "comments"."landlord_id" IS NULL ORDER BY comments.created_at DESC
INSERT INTO "comments" ("comment", "created_at", "ip", "landlord_id", "terms", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "test 1"], ["created_at", Tue, 18 Jun 2013 23:18:40 UTC +00:00], ["ip", nil], ["landlord_id", 1], ["terms", nil], ["updated_at", Tue, 18 Jun 2013 23:18:40 UTC +00:00]]
INSERT INTO "landlords" ("city", "name", "province") VALUES (?, ?, ?)  [["city", "test 1"], ["name", "test 1"], ["province", "test 1"]]
UPDATE "comments" SET "comment" = 'OANSDFUIOBASDUIFBSHDBGFUIVHBGJKDRHGUDRHGJZDRHGUILDBHYBKIDHJGNKLGFHJIDFHJGIO', "updated_at" = '2013-06-23 20:26:58.377148' WHERE "comments"."id" = 9