app/controllers/landlords_controller.rb

   def update

    @landlord = Landlord.find(params[:id])
---
SELECT "landlords".* FROM "landlords" WHERE "landlords"."id" = ? ORDER BY landlords.name ASC LIMIT 1  [["id", "2"]]