app/views/landlords/index.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."landlord_id" = 15
---
      <td>
      	<%= l.comments.count %>