app/views/landlords/new.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."landlord_id" = 2 ORDER BY comments.created_at DESC
SELECT COUNT(*) FROM "comments" WHERE "comments"."landlord_id" = 2
---
	<div class ="controls" >
		<% @landlord.comments.build unless @landlord.comments.any? %>