app/views/landlords/show.html.erb

		<div class="span4">
			<%= @landlord.comments.count %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."landlord_id" = 1 ORDER BY comments.created_at DESC
SELECT COUNT(*) FROM "comments" WHERE "comments"."landlord_id" = 1